In [1]:
import numpy as np
import pandas as pd

In [2]:
users = pd.read_csv('usersv2.csv')

In [3]:
users

,name,age,username,email,country,postcode,gender
0,Ms Fátima Martin,42,goldenmouse797,fatima.martin@example.com,Spain,43746,female
1,Mrs Molly Garrett,30,smallpanda982,molly.garrett@example.com,Ireland,57660,female
2,Ms Veena Kulkarni,53,smalltiger174,veena.kulkarni@example.com,India,29797,female
3,Miss Sheryl Cole,74,beautifulcat191,sheryl.cole@example.com,United Kingdom,TH3 7XG,female
4,Ms Nataša Subašić,55,bigbird256,natasa.subasic@example.com,Serbia,83260,female
...,...,...,...,...,...,...,...
1995,Ms Viktoria Lauritsen,38,heavyzebra441,viktoria.lauritsen@example.com,Norway,1545,female
1996,Mr Christian Sørhaug,28,goldensnake897,christian.sorhaug@example.com,Norway,3614,male
1997,Ms Maria Peković,45,redzebra951,maria.pekovic@example.com,Serbia,30159,female
1998,Mrs Nicole Jensen,78,beautifuldog292,nicole.jensen@example.com,United Kingdom,L9J 1QE,female
1999,Mr Percy Blankenstein,36,ticklishostrich632,percy.blankenstein@example.com,Netherlands,3143 RR,male

## Ejercicios

1. Mostrar en consola el nombre de todos los usuarios cuya edad se encuentre entre 10 a 20 y 40 a 70

In [9]:
users[((users['age'] >= 10) & (users['age'] <= 20)) | ((users['age'] >= 40) & (users['age'] <= 70))]['name']

0         Ms Fátima Martin
2        Ms Veena Kulkarni
4        Ms Nataša Subašić
6           Mr Oscar Olsen
7          Ms Marta Selvik
               ...
1989    Miss Sylvana Stoll
1990      Mr Marius Møller
1991         Mr Jake Moore
1993    Mr Zachary Stevens
1997      Ms Maria Peković
Name: name, Length: 1119, dtype: object

In [10]:
users[(users['age'].between(10,20)) | (users['age'].between(40,70))]['name']

0         Ms Fátima Martin
2        Ms Veena Kulkarni
4        Ms Nataša Subašić
6           Mr Oscar Olsen
7          Ms Marta Selvik
               ...
1989    Miss Sylvana Stoll
1990      Mr Marius Møller
1991         Mr Jake Moore
1993    Mr Zachary Stevens
1997      Ms Maria Peković
Name: name, Length: 1119, dtype: object

2. Mostrar en consola todos los usuarios con correo electrónico

In [11]:
users[users['email'].notna()]

,name,age,username,email,country,postcode,gender
0,Ms Fátima Martin,42,goldenmouse797,fatima.martin@example.com,Spain,43746,female
1,Mrs Molly Garrett,30,smallpanda982,molly.garrett@example.com,Ireland,57660,female
2,Ms Veena Kulkarni,53,smalltiger174,veena.kulkarni@example.com,India,29797,female
3,Miss Sheryl Cole,74,beautifulcat191,sheryl.cole@example.com,United Kingdom,TH3 7XG,female
4,Ms Nataša Subašić,55,bigbird256,natasa.subasic@example.com,Serbia,83260,female
...,...,...,...,...,...,...,...
1995,Ms Viktoria Lauritsen,38,heavyzebra441,viktoria.lauritsen@example.com,Norway,1545,female
1996,Mr Christian Sørhaug,28,goldensnake897,christian.sorhaug@example.com,Norway,3614,male
1997,Ms Maria Peković,45,redzebra951,maria.pekovic@example.com,Serbia,30159,female
1998,Mrs Nicole Jensen,78,beautifuldog292,nicole.jensen@example.com,United Kingdom,L9J 1QE,female
1999,Mr Percy Blankenstein,36,ticklishostrich632,percy.blankenstein@example.com,Netherlands,3143 RR,male

3. Mostrar en pantalla el nombre y correo electrónico del usuario más joven en Canadá

In [14]:
users[users['country'] == 'Canada'].sort_values('age')[['name','email']].head(1)

                 name                      email
262  Mr Dylan Ouellet  dylan.ouellet@example.com

4. Listar en consola los 3 países con menor cantidad de usuarios

In [21]:
users.groupby('country')['country'].count().sort_values().head(3)

country
Iran      70
Mexico    83
Serbia    86
Name: country, dtype: int64

5. Obtener el país con mayor cantidad de usuarios cuya edad sea mayor a 50

In [30]:
users[users['age'] > 50].groupby('country')['country'].count().sort_values(ascending=False).head(1)

country
India    54
Name: country, dtype: int64

6. Obtener el país con mayor promedio de edad

In [34]:
users.groupby('country')['age'].mean().sort_values(ascending=False).head(1)

country
India    52.540816
Name: age, dtype: float64

7. Mostrar en consola el país con más hombres

In [40]:
users[users['gender'] == 'male'].groupby('country')['country'].count().sort_values(ascending=False).head(1)

country
Australia    60
Name: country, dtype: int64

8. Mostrar en consola el nombre, username y edad de todos los usuarios cuya edad es mayor a 10 y no sean de los países México, Brasil y Canadá

In [53]:
users[(users['age'] > 10) & (~users['country'].isin(['Mexico','Brazil','Canada']))][['name','username','age']]

                       name            username  age
0          Ms Fátima Martin      goldenmouse797   42
1         Mrs Molly Garrett       smallpanda982   30
2         Ms Veena Kulkarni       smalltiger174   53
3          Miss Sheryl Cole     beautifulcat191   74
4         Ms Nataša Subašić          bigbird256   55
...                     ...                 ...  ...
1995  Ms Viktoria Lauritsen       heavyzebra441   38
1996   Mr Christian Sørhaug      goldensnake897   28
1997       Ms Maria Peković         redzebra951   45
1998      Mrs Nicole Jensen     beautifuldog292   78
1999  Mr Percy Blankenstein  ticklishostrich632   36

[1719 rows x 3 columns]

9. Mostrar en consola el código postal de todos los usuarios de México

In [54]:
users[users['country'] == 'Mexico']['postcode']

9       43691
49      16073
52      52761
90      16543
91      78696
        ...
1813    96954
1822    61953
1836    35219
1912    56421
1964    58319
Name: postcode, Length: 83, dtype: object

10. Obtener la edad que más se repite en el DataFrame

In [59]:
users.groupby('age')['age'].count().sort_values(ascending=False).head(1)

age
44    50
Name: age, dtype: int64

11. Obtener la edad que menos se repite en el DataFrame

In [60]:
users.groupby('age')['age'].count().sort_values().head(1)

age
78    14
Name: age, dtype: int64